cfg/Catalogs/СохраненныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СохраненныеНастройки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
				<xr:Item>Catalog.ГруппыПользователей</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемыйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьПриЗапуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Enums/ТипыНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыНастроек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеНастройкиОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастрокиФормы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/СохраненныеНастройки/Forms/ФормаВыбора/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ИмяОбъекта = Сред(Отбор.НастраиваемыйОбъект.Значение, Найти(Отбор.НастраиваемыйОбъект.Значение, ".") + 1);
	СинонимОбъекта = Метаданные.Отчеты.Найти(ИмяОбъекта).Синоним;
	// Установка заголовка формы.
	Если РежимСохраненияНастройки Тогда
		ЭтаФорма.Заголовок = НСтр("ru='Сохранение настройки для ""';uk='Збереження настройки для ""'") + СинонимОбъекта + """";
	Иначе
		ЭтаФорма.Заголовок = НСтр("ru='Выбор настройки для ""';uk='Вибір настройки для ""'") + СинонимОбъекта + """";
	КонецЕсли;
	
	// Установка отбора по пользователю.
	Отбор.Владелец.Использование = Истина;
	Отбор.Владелец.ВидСравнения  = ВидСравнения.ВСписке;
	//Отбор.Владелец.Значение      = УправлениеПользователями.СписокГруппВключающихПользователя();
	Отбор.Владелец.Значение.Добавить(ПараметрыСеанса.ТекущийПользователь);
	Отбор.Владелец.Значение.Добавить(Справочники.ГруппыПользователей.ВсеПользователи);
	
	Отбор.ПометкаУдаления.Установить(ложь);
	
	// Установка доступности отбора и порядка.
	СохранениеНастроек.УстановитьДоступностьОтбора(ЭлементыФормы.СправочникСписокСохраненныеНастройки, "ЭтоГруппа, НастраиваемыйОбъект, ТипНастройки");
	СохранениеНастроек.УстановитьДоступностьПорядка(ЭлементыФормы.СправочникСписокСохраненныеНастройки);
	
	// Настройка вида списка.
	СохранениеНастроек.НастроитьВидСписка(ЭлементыФормы.СправочникСписокСохраненныеНастройки, глЗначениеПеременной("глТекущийПользователь"));
	ОбновитьВидСписка(ЭлементыФормы.ДействияФормы.Кнопки.ВидСписка.Пометка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СПИСКА

Процедура СправочникСписокСохраненныеНастройкиПриНачалеРедактирования(Элемент, НоваяСтрока)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущиеДанные;
		
		ТекущиеДанные.Владелец            = глЗначениеПеременной("глТекущийПользователь");
		ТекущиеДанные.НастраиваемыйОбъект = Отбор.НастраиваемыйОбъект.Значение;
		ТекущиеДанные.ТипНастройки        = Перечисления.ТипыНастроек.НастройкиОтчета;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокСохраненныеНастройкиВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	
	Если НЕ ЗначениеЗаполнено(ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущаяСтрока)
	 ИЛИ ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущаяСтрока.ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = Тип("Форма") Тогда
		Если ВладелецФормы.Метаданные().Имя = "НавигаторПоСтандартнымОтчетам" Тогда
			ВладелецФормы.ОтчетОбъект.СохраненнаяНастройка = ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущаяСтрока;
		Иначе
			
			ВладелецФормы.СохраненнаяНастройка = ЭлементыФормы.СправочникСписокСохраненныеНастройки.ТекущаяСтрока;
		КонецЕсли;	
		Если РежимСохраненияНастройки Тогда
			ВладелецФормы.СохранитьНастройку();
		Иначе
			ВладелецФормы.ПрименитьНастройку();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействияФормыВидСписка(Кнопка)

	Кнопка.Пометка = НЕ Кнопка.Пометка;

	ОбновитьВидСписка(Кнопка.Пометка);
	
КонецПроцедуры

Процедура ОбновитьВидСписка(Пометка)

	ЭлементыФормы.СправочникСписокСохраненныеНастройки.Дерево = Пометка;
	ЭлементыФормы.СправочникСписокСохраненныеНастройки.ИерархическийПросмотр = Пометка;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// РАЗДЕЛ ОСНОВНОЙ ПРОГРАММЫ
